# SDC file for ORPSoC
# This file is autogenerated - any changes will be overwritten
# See the Makefile in syn/xst/bin to make changes
# Main system clock (50 Mhz)
create_clock -name {sys_clk_pad_i} -period 20.000ns -waveform {0.000 10.000} [get_ports {sys_clk_pad_i}]
# SRAM clock (100 MHz)
#create_clock -name {sdram_clk_pad_o} -period 10.000ns -waveform {0.000 5.000} [get_ports {sdram_clk_pad_o}]

# Generated clock constraint - SRAM (100Mz)
#create_generated_clock -name {sdram_clk_o} -source [get_pins {clkgen0|pll0|altpll_component|auto_generated|pll1|inclk[0]}] -multiply_by 2 -duty_cycle 50 -master_clk {sys_clk_pad_i} [get_pins {clkgen0|pll0|altpll_component|auto_generated|pll1|clk[0]}]

# Generated clock constraint - or1200 (50Mz)
#create_generated_clock -name {wb_clk_o} -source [get_pins {clkgen0|pll0|altpll_component|auto_generated|pll1|inclk[0]}] -multiply_by 1 -duty_cycle 50 -master_clk {sys_clk_pad_i} [get_pins {clkgen0|pll0|altpll_component|auto_generated|pll1|clk[1]}]

# Automatically constrain PLL and other generated clocks
derive_pll_clocks -create_base_clocks

# Automatically calculate clock uncertainty to jitter and other effects.
derive_clock_uncertainty

# Ignore timing on the reset input
set_false_path -through [get_nets {rst_n_pad_i}]

